---
type: FieldValues
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 3
tags: [revit-api, class]
---

# FieldValues

`Autodesk.Revit.DB.Analysis.FieldValues` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FieldValues | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |